package ru.vladm.routefederal.data

data class Link(
    val from: String,
    val to: String,
    val transportType: String,
)

object Links {
    val all = listOf(
        // Поезда дальнего следования
        Link("s2000001", "s2060340", "train"),    // Курский вокзал — Владимир
        Link("s9879173", "s2060340", "train"),    // Восточный вокзал — Владимир
        Link("s9879173", "s9612089", "train"),    // Восточный вокзал — Нижний Новгород
        Link("s2060340", "s9612089", "train"),    // Владимир — Нижний Новгород
        // Ласточки Москва — Нижний Новгород останавливаются в Орехово-Зуеве
        Link("s9879173", "s9601539", "train"),    // Восточный вокзал — Орехово-Зуево
        Link("s2000001", "s9601539", "train"),    // Курский вокзал — Орехово-Зуево
        Link("s9601539", "s2060340", "train"),    // Орехово-Зуево — Владимир
        // Электрички
        Link("s2000001", "s9601539", "suburban"), // Курский вокзал — Орехово-Зуево
        Link("s9601539", "s9612144", "suburban"), // Орехово-Зуево — Петушки
        Link("s9612144", "s2060340", "suburban"), // Петушки — Владимир
        Link("s2000001", "s2060340", "suburban"), // Курский вокзал — Владимир
        // Автобусы
        Link("c213", "c192", "bus"),              // Москва — Владимир
        Link("c192", "c23243", "bus"),            // Владимир — Нижний Новгород
        Link("c213", "c23243", "bus"),            // Москва — Нижний Новгород
        Link("c192", "c10671", "bus"),            // Владимир — Суздаль
        Link("c213", "c10671", "bus"),            // Москва — Суздаль (автобусы на Шую и Иваново)
    )
}
