package ru.vladm.routefederal.data

class StationRepository(
    val cities: List<City> = listOf(
        City("c213", "Москва", 55.7558, 37.6173),
        City("c10745", "Орехово-Зуево", 55.8067, 38.9618),
        City("c10669", "Петушки", 55.9296, 39.4503),
        City("c192", "Владимир", 56.1290, 40.4066),
        City("c10671", "Суздаль", 56.4198, 40.4495),
        City("c23243", "Нижний Новгород", 56.3269, 44.0059),
    ),
    val stations: List<Station> = listOf(
        Station("s9855267", "c213", "Автостанция Котельники"),
        Station("s9879173", "c213", "Москва (Восточный вокзал)"),
        Station("s2000001", "c213", "Москва (Курский вокзал)"),
        Station("s9857280", "c213", "Москва, м. Котельники / ТЦ «Грант»"),
        Station("s9878376", "c213", "Центральный автовокзал"),
        Station("s2060340", "c192", "Владимир"),
        Station("s9874973", "c192", "Владимир, Московское шоссе / ТЦ Лента"),
        Station("s9623080", "c192", "Владимир, автовокзал"),
        Station("s9848630", "c192", "Владимир, гипермаркет «Глобус»"),
        Station("s9650605", "c192", "Владимир, трасса"),
        Station("s9612089", "c23243", "Нижний Новгород (Московский вокзал)"),
        Station("s9655203", "c23243", "Нижний Новгород, Канавинский автовокзал"),
        Station("s9623398", "c23243", "Нижний Новгород, автовокзал «Щербинки»"),
        Station("s9650603", "c23243", "Нижний Новгород, школа № 98"),
        Station("s9601539", "c10745", "Орехово-Зуево"),
        Station("s9612144", "c10669", "Петушки"),
        Station("s9623084", "c10671", "Суздаль, автовокзал"),
        Station("s9746228", "c10671", "Суздаль, поворот"),
    ),
)
