package ru.vladm.routefederal.data

class StationRepository (val stations: List<Station> = listOf(
    Station("s9855267", "c213", "Автостанция Котельники"),
    Station("s9879173", "c213", "Москва (Восточный вокзал)"),
    Station("s2000001", "c213", "Москва (Курский вокзал)"),
    Station("s9857280", "c213", "Москва, м. Котельники / ТЦ «Грант»"),
    Station("s9878376", "c213", "Центральный автовокзал"),
    Station("s2060340", "c192", "Владимир"),
    Station("s9874973", "c192", "Владимир, Московское шоссе / ТЦ Лента"),
    Station("s9623080", "c192", "Владимир, автовокзал"),
    Station("s9848630", "c192", "Владимир, гипермаркет «Глобус»"),
    Station("s9650605", "c192", "Владимир, трасса"),
    Station("s9612089", "c23243", "Нижний Новгород (Московский вокзал)"),
    Station("s9655203", "c23243", "Нижний Новгород, Канавинский автовокзал"),
    Station("s9623398", "c23243", "Нижний Новгород, автовокзал «Щербинки»"),
    Station("s9650603", "c23243", "Нижний Новгород, школа № 98"),
    Station("s9601539", "c10745", "Орехово-Зуево"),
    Station("s9612144", "c10669", "Петушки"),
    Station("s9623084", "c10671", "Суздаль, автовокзал"),
    Station("s9746228", "c10671", "Суздаль, поворот"),
))
